#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-ojFJdwhvesspn1Tm

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
digitalocean_ssh_key.secondary: Refreshing state... [id=38557683]
digitalocean_ssh_key.m2: Refreshing state... [id=38210829]
module.config_bucket.random_id.this: Refreshing state... [id=aPbH]
module.postgres_backups_bucket.random_id.this: Refreshing state... [id=Ze9c]
module.remote_state_bucket.random_id.this: Refreshing state... [id=WvCN]
digitalocean_droplet.postgres: Refreshing state... [id=359948759]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
module.remote_state_bucket.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-5af08d]
aws_iam_user.configuration_deployer: Refreshing state... [id=configuration.deployer]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
module.postgres_backups_bucket.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-65ef5c]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
module.config_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-68f6c7]
module.primary.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.primary.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
aws_iam_access_key.configuration_deployer: Refreshing state... [id=AKIAYEHTA3LZKXOXWTYC]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
module.primary.aws_iam_role.this: Refreshing state... [id=primary-role]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
module.primary.aws_iam_instance_profile.this: Refreshing state... [id=primary-instance-profile]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
module.primary.aws_security_group.this: Refreshing state... [id=sg-0091bb75a58993a5a]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.primary.data.aws_subnet.self: Refreshing...
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
module.postgres_backups_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-65ef5c]
module.remote_state_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-5af08d]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
module.config_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-68f6c7]
aws_iam_user_policy.configuration_deployer: Refreshing state... [id=configuration.deployer:configuration.deployer.policy]
module.primary.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/primary-policy]
module.primary.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
module.primary.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-1256723377]
module.primary.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-163175639]
module.primary.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-2795019150]
module.primary.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-1566144345]
module.primary.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-1723768472]
module.primary.aws_instance.this: Refreshing state... [id=i-0a5ed89efb83e4db7]
module.primary.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-1043220573]
module.primary.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-1002163884]
module.primary.aws_iam_role_policy_attachment.this: Refreshing state... [id=primary-role-20231011172748016700000001]
module.primary.aws_eip.this: Refreshing state... [id=eipalloc-070e793ecca60b9e5]
aws_route53_record.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.opentracker_ses_verification will be created
  + resource "aws_route53_record" "opentracker_ses_verification" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "TXT"
      + zone_id         = "Z03017682LQ8TW5YUFGE0"
    }

  # aws_ses_domain_identity.opentracker will be created
  + resource "aws_ses_domain_identity" "opentracker" {
      + arn                = (known after apply)
      + domain             = "opentracker.app"
      + id                 = (known after apply)
      + verification_token = (known after apply)
    }

  # aws_ses_domain_identity_verification.opentracker will be created
  + resource "aws_ses_domain_identity_verification" "opentracker" {
      + arn    = (known after apply)
      + domain = (known after apply)
      + id     = (known after apply)
    }

  # aws_ses_domain_mail_from.noreply will be created
  + resource "aws_ses_domain_mail_from" "noreply" {
      + behavior_on_mx_failure = "UseDefaultValue"
      + domain                 = "noreply@opentracker.app"
      + id                     = (known after apply)
      + mail_from_domain       = "opentracker.app"
    }

  # aws_ses_email_identity.noreply will be created
  + resource "aws_ses_email_identity" "noreply" {
      + arn   = (known after apply)
      + email = "noreply@opentracker.app"
      + id    = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>